---
kind: type
id: T:Autodesk.Revit.DB.FilteredWorksetIdIterator
source: html/3d4b2969-fe55-7b1a-bdc0-b60165e12856.htm
---
# Autodesk.Revit.DB.FilteredWorksetIdIterator

An iterator to a set of workset ids filtered by the settings of a FilteredWorksetCollector.

## Syntax (C#)
```csharp
public class FilteredWorksetIdIterator : IEnumerator<WorksetId>
```